{
  "project": [
    {
      "name": "Using Laravel to build the back end of a book swap site",
      "img": "laravel-book-swap.png",
      "desc": "Using Laravel and a supplied React front-end to develop the back end API of a book swap site. I pair programmed a number of elements including appropriate unit tests, methods to get, claim and review books along with mob programming an admin level dashboard with associated log in function to view popular books and genres. ",
      "url": "https://github.com/iO-Academy/2024-may-sde-library-rats-book-swap-api",
      "live": "https://2024-may-bookswap-fe-library-rats.dev.io-academy.uk"
    },
    {
      "name": "Using React to build an invoicing app",
      "img": "React.png",
      "desc": "Using react with a provided API, we developed an invoicing system to match a required spec and design. I pair programmed the homepage showing all invoices and their status along with the number unpaid and the individual invoice page showing the full details of an invoice, using Tailwind for the styling.",
      "url": "https://github.com/iO-Academy/2024-may-invoicing-sw-flamingos",
      "live": "https://2024-may-sde-invoicing-sw-flamingos.dev.io-academy.uk/"
    },
    {
      "name": "Using PHP, MySQL, Object-Oriented Programming",
      "img": "OOP.png",
      "desc": "Using PHP and a supplied SQL database to develop a music app matching required spec and design. I pair programmed the homepage showing three random artists and their albums, a page displaying all artists, their albums and song counts on each album and also a favourites element on the homepage displaying the five most played artists.  All of the above involved developing database queries and fetches along with coding the classes, entities and services required to display the elements properly.",
      "url": "https://github.com/iO-Academy/2024-may-music-player-uWu-ShruWu",
      "live": "https://2024-may-sde-music-player-uwu-shruwu.dev.io-academy.uk/artists.php"
    },
    {
      "name": "React Exercises",
      "img": "Reactexercises.png",
      "desc": "React exercises - a mega counter, an opinion tracker and a Bitcoin to Freddo bars currency converter that pulls data from an api every 30 seconds",
      "url": "https://github.com/AndyB0o1/ReactExercises",
      "live": "https://react.2024-andyb.dev.io-academy.uk/"
    },
    {
      "name": "PHP: simple Blackjack simulator",
      "img": "Blackjack.png",
      "desc": "A simple Blackjack simulator in PHP",
      "url": "https://github.com/AndyB0o1/php-simple-blackjack-simulator",
      "live": "https://2024-andyb.dev.io-academy.uk/php-simple-blackjack-simulator/"
    }
  ]
}